In [81]:
import pandas as pd
from statsmodels.tsa.arima.model import ARIMA
import matplotlib.pyplot as plt

In [82]:
df = pd.read_csv('C:/Users/arbru/OneDrive/Desktop/RAI/Artif-I/backend/datasets/expense_data_1.csv')
print(df.info(), "\n Desc. stats",df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277 entries, 0 to 276
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            277 non-null    object
 1   Account         277 non-null    object
 2   Category        277 non-null    object
 3   Subcategory     0 non-null      float64
 4   Note            273 non-null    object
 5   INR             277 non-null    float64
 6   Income/Expense  277 non-null    object
 7   Note.1          0 non-null      float64
 8   Amount          277 non-null    float64
 9   Currency        277 non-null    object
 10  Account.1       277 non-null    float64
dtypes: float64(5), object(6)
memory usage: 23.9+ KB
None
 Desc. stats        Subcategory           INR  Note.1        Amount     Account.1
count          0.0    277.000000     0.0    277.000000    277.000000
mean           NaN    410.750903     NaN    406.759134    406.759134
std            NaN   1065.756569     NaN   1065.158318   1065.158318
min            NaN      3.000000     NaN      3.000000      3.000000
25%            NaN     50.000000     NaN     50.000000     50.000000
50%            NaN    128.000000     NaN    125.000000    125.000000
75%            NaN    301.150000     NaN    300.000000    300.000000
max            NaN  10000.000000     NaN  10000.000000  10000.000000

In [83]:
df.head()

,Date,Account,Category,Subcategory,Note,INR,Income/Expense,Note.1,Amount,Currency,Account.1
0,3/2/2022 10:11,CUB - online payment,Food,NaN,Brownie,50.0,Expense,NaN,50.0,INR,50.0
1,3/2/2022 10:11,CUB - online payment,Other,NaN,To lended people,300.0,Expense,NaN,300.0,INR,300.0
2,3/1/2022 19:50,CUB - online payment,Food,NaN,Dinner,78.0,Expense,NaN,78.0,INR,78.0
3,3/1/2022 18:56,CUB - online payment,Transportation,NaN,Metro,30.0,Expense,NaN,30.0,INR,30.0
4,3/1/2022 18:22,CUB - online payment,Food,NaN,Snacks,67.0,Expense,NaN,67.0,INR,67.0

In [84]:
df.drop(columns=['Subcategory', 'INR','Note', 'Note.1', 'Account.1'], inplace=True)
df.head()

,Date,Account,Category,Income/Expense,Amount,Currency
0,3/2/2022 10:11,CUB - online payment,Food,Expense,50.0,INR
1,3/2/2022 10:11,CUB - online payment,Other,Expense,300.0,INR
2,3/1/2022 19:50,CUB - online payment,Food,Expense,78.0,INR
3,3/1/2022 18:56,CUB - online payment,Transportation,Expense,30.0,INR
4,3/1/2022 18:22,CUB - online payment,Food,Expense,67.0,INR

In [85]:
df['Amount'] = (df['Amount'] / 10).round(2)
df.columns = [col.lower() for col in df.columns]
df['currency'] = df['currency'].replace('INR', 'EUR')
df.head(3)

,date,account,category,income/expense,amount,currency
0,3/2/2022 10:11,CUB - online payment,Food,Expense,5.0,EUR
1,3/2/2022 10:11,CUB - online payment,Other,Expense,30.0,EUR
2,3/1/2022 19:50,CUB - online payment,Food,Expense,7.8,EUR

In [86]:
df.to_csv('C:/Users/arbru/OneDrive/Desktop/RAI/Artif-I/backend/datasets/cleaned_expense_data.csv', index=False)